Revit 2027 API
ParameterTypeId.FabricationProductDataItemDescription Property
 "Product Short Description"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationProductDataItemDescription { get; }
Public Shared ReadOnly Property FabricationProductDataItemDescription As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationProductDataItemDescription {
	ForgeTypeId^ get ();
}
static member FabricationProductDataItemDescription : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace